PANS_py/phase_average/triPrism_SST_mesh/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (16.6 0 0);

boundaryField
{   
    Inlet 
    {
      type               fixedValue; //inletOutlet;
      value         	$internalField;
    }

    Outlet
    {
      type               zeroGradient; //pressureInletOutletVelocity;
      //tangentialVelocity uniform (0 0 0);
      //value		 uniform (0 0 0);
    }


    Side
    {   
        type             empty;
    }

    Prism
    {
        type             noSlip;
    }
    topWall
    {
        type             noSlip;
    }
    botWall
    {
        type             noSlip;
    }
}


// ************************************************************************* //
