PANS_py/phase_average/triPrism_SST_mesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    Side
    {
        type            empty;
        nFaces          64102;
        startFace       63661;
    }
    Inlet
    {
        type            patch;
        nFaces          126;
        startFace       127763;
    }
    topWall
    {
        type            wall;
        nFaces          271;
        startFace       127889;
    }
    botWall
    {
        type            wall;
        nFaces          271;
        startFace       128160;
    }
    Prism
    {
        type            wall;
        nFaces          127;
        startFace       128431;
    }
    Outlet
    {
        type            patch;
        nFaces          87;
        startFace       128558;
    }
)

// ************************************************************************* //
