PANS_py/phase_average/triPrism_SST_mesh/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;



RAS
{
    RASModel       kOmegaSST;
    //RASModel       PANSkOmegaSST;
    
    PANSkOmegaSSTCoeffs
    {
    	//fk 1.0;
        //fKupperLimit  0.5;
        //fKlowerLimit  0.1;

        //delta cubeRootVol;

        cubeRootVolCoeffs{}
    }

    turbulence      on;

    printCoeffs     on;
}


// ************************************************************************* //
