PANS_py/phase_average/triPrism_SST_mesh/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          0.0005;

writeControl 	adjustableRunTime;

writeInterval   0.001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.95;
libs ("libIncompressibleTurbulenceModels_mod.so");

functions
{
    fieldAverage1
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects");
        writeControl    writeTime;
        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
            nut
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
            R
            {
            	mean        off;
                prime2Mean  off;
                base        time;
            }
            L
            {
            	mean        off;
                prime2Mean  off;
                base        time;
            }
        );
    }

    forces
    {
        type            forceCoeffs;
        libs            ("libforces");
        writeControl	writeTime;
        outputInterval      timestep;

        patches
        (
           Prism
        );
        p               p;
        U               U;
        rho             rhoInf;
        rhoInf      1;

        CofR        (0 0 0);
        liftDir     (0 1 0);
        dragDir     (1 0 0);
        pitchAxis   (0 0 1);
        magUInf     1.;
        lRef        1.;
        Aref        1.;
    }
    
    yPlus1
    {
	    // Mandatory entries (unmodifiable)
	    type            yPlus;
	    libs            (fieldFunctionObjects);

	    // Optional (inherited) entries
	    writeControl    writeTime;
     }
    sample
    {
        type            sets;
        libs            ("libsampling");
        writeControl    writeTime;
        interpolationScheme cellPoint;
        setFormat raw;
    sets
       (

);
fields          ( p  );
}
}


// ************************************************************************* //
