PANS_py/phase_average/triPrism_SST_mesh/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         CrankNicolson 0.9;
    //ddt(phi)        backward; //CrankNicolson 0.9;
    //default		backward;
}

gradSchemes
{
    default          Gauss linear; //leastSquares;
}

divSchemes
{
    default          none;
    div(phi,U)       Gauss LUST grad(U);
    //turbulence       Gauss upwind; //limitedLinear 1;
    div(phi,p)	     Gauss linearUpwind grad(U)
    div(phi,R)	     Gauss linearUpwind grad(U);
    div(phi,k)       Gauss linearUpwind grad(U); 
    div(phi,omega)   Gauss linearUpwind grad(U);
    div((nuEff*dev2(T(grad(U))))) Gauss linear 1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p               ;
}

wallDist
{   
    method          meshWave;
}   
    

// ************************************************************************* //
