PANS_py/phase_average/triPrism_SST_mesh/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPointFace;

setFormat       raw;

sets
(
   top 
    {
        type    points;
        axis    x;
        points   (
 ( -0.500000000       0.00000000       0.00000000     )
 ( -0.484126985      0.124984264       0.00000000     )
 ( -0.468253970      0.175323188       0.00000000     )
 ( -0.452380955      0.212958857       0.00000000     )
 ( -0.436507940      0.243845895       0.00000000     )
 ( -0.420634925      0.270307720       0.00000000     )
 ( -0.404761910      0.293543518       0.00000000     )
 ( -0.388888896      0.314269692       0.00000000     )
 ( -0.373015881      0.332955182       0.00000000     )
 ( -0.357142866      0.349927098       0.00000000     )
 ( -0.341269851      0.365424246       0.00000000     )
 ( -0.325396836      0.379627317       0.00000000     )
 ( -0.309523791      0.392676741       0.00000000     )
 ( -0.293650776      0.404684097       0.00000000     )
 ( -0.277777761      0.415739715       0.00000000     )
 ( -0.261904746      0.425917715       0.00000000     )
 ( -0.246031731      0.435279667       0.00000000     )
 ( -0.230158716      0.443877190       0.00000000     )
 ( -0.214285702      0.451753974       0.00000000     )
 ( -0.198412687      0.458947062       0.00000000     )
 ( -0.182539672      0.465488225       0.00000000     )
 ( -0.166666657      0.471404523       0.00000000     )
 ( -0.150793642      0.476719290       0.00000000     )
 ( -0.134920627      0.481452405       0.00000000     )
 ( -0.119047582      0.485620916       0.00000000     )
 ( -0.103174567      0.489239216       0.00000000     )
 (  -8.73015523E-02  0.492319465       0.00000000     )
 (  -7.14285374E-02  0.494871676       0.00000000     )
 (  -5.55555224E-02  0.496903986       0.00000000     )
 (  -3.96825075E-02  0.498422831       0.00000000     )
 (  -2.38094926E-02  0.499432802       0.00000000     )
 (  -7.93647766E-03  0.499936998       0.00000000     )
 (   7.93653727E-03  0.499936998       0.00000000     )
 (   2.38095522E-02  0.499432772       0.00000000     )
 (   3.96825671E-02  0.498422801       0.00000000     )
 (   5.55555820E-02  0.496903986       0.00000000     )
 (   7.14285970E-02  0.494871676       0.00000000     )
 (   8.73016119E-02  0.492319435       0.00000000     )
 (  0.103174627      0.489239216       0.00000000     )
 (  0.119047642      0.485620886       0.00000000     )
 (  0.134920657      0.481452405       0.00000000     )
 (  0.150793672      0.476719290       0.00000000     )
 (  0.166666687      0.471404493       0.00000000     )
 (  0.182539701      0.465488195       0.00000000     )
 (  0.198412716      0.458947062       0.00000000     )
 (  0.214285731      0.451753944       0.00000000     )
 (  0.230158746      0.443877190       0.00000000     )
 (  0.246031761      0.435279638       0.00000000     )
 (  0.261904836      0.425917655       0.00000000     )
 (  0.277777851      0.415739655       0.00000000     )
 (  0.293650866      0.404684037       0.00000000     )
 (  0.309523880      0.392676681       0.00000000     )
 (  0.325396895      0.379627258       0.00000000     )
 (  0.341269910      0.365424216       0.00000000     )
 (  0.357142925      0.349927038       0.00000000     )
 (  0.373015940      0.332955122       0.00000000     )
 (  0.388888955      0.314269572       0.00000000     )
 (  0.404761970      0.293543428       0.00000000     )
 (  0.420634985      0.270307600       0.00000000     )
 (  0.436508000      0.243845776       0.00000000     )
 (  0.452381015      0.212958723       0.00000000     )
 (  0.468254030      0.175323009       0.00000000     )
 (  0.484127045      0.124984026       0.00000000     )
 (  0.500000000       0.00000000       0.00000000     )
         );
    interpolate true ;
    }
 bottom 
    {
        type    points;
        axis    x;
        points   (
( -0.500000000      -0.00000000       0.00000000     )
 ( -0.484126985     -0.124984264       0.00000000     )
 ( -0.468253970     -0.175323188       0.00000000     )
 ( -0.452380955     -0.212958857       0.00000000     )
 ( -0.436507940     -0.243845895       0.00000000     )
 ( -0.420634925     -0.270307720       0.00000000     )
 ( -0.404761910     -0.293543518       0.00000000     )
 ( -0.388888896     -0.314269692       0.00000000     )
 ( -0.373015881     -0.332955182       0.00000000     )
 ( -0.357142866     -0.349927098       0.00000000     )
 ( -0.341269851     -0.365424246       0.00000000     )
 ( -0.325396836     -0.379627317       0.00000000     )
 ( -0.309523791     -0.392676741       0.00000000     )
 ( -0.293650776     -0.404684097       0.00000000     )
 ( -0.277777761     -0.415739715       0.00000000     )
 ( -0.261904746     -0.425917715       0.00000000     )
 ( -0.246031731     -0.435279667       0.00000000     )
 ( -0.230158716     -0.443877190       0.00000000     )
 ( -0.214285702     -0.451753974       0.00000000     )
 ( -0.198412687     -0.458947062       0.00000000     )
 ( -0.182539672     -0.465488225       0.00000000     )
 ( -0.166666657     -0.471404523       0.00000000     )
 ( -0.150793642     -0.476719290       0.00000000     )
 ( -0.134920627     -0.481452405       0.00000000     )
 ( -0.119047582     -0.485620916       0.00000000     )
 ( -0.103174567     -0.489239216       0.00000000     )
 (  -8.73015523E-02 -0.492319465       0.00000000     )
 (  -7.14285374E-02 -0.494871676       0.00000000     )
 (  -5.55555224E-02 -0.496903986       0.00000000     )
 (  -3.96825075E-02 -0.498422831       0.00000000     )
 (  -2.38094926E-02 -0.499432802       0.00000000     )
 (  -7.93647766E-03 -0.499936998       0.00000000     )
 (   7.93653727E-03 -0.499936998       0.00000000     )
 (   2.38095522E-02 -0.499432772       0.00000000     )
 (   3.96825671E-02 -0.498422801       0.00000000     )
 (   5.55555820E-02 -0.496903986       0.00000000     )
 (   7.14285970E-02 -0.494871676       0.00000000     )
 (   8.73016119E-02 -0.492319435       0.00000000     )
 (  0.103174627     -0.489239216       0.00000000     )
 (  0.119047642     -0.485620886       0.00000000     )
 (  0.134920657     -0.481452405       0.00000000     )
 (  0.150793672     -0.476719290       0.00000000     )
 (  0.166666687     -0.471404493       0.00000000     )
 (  0.182539701     -0.465488195       0.00000000     )
 (  0.198412716     -0.458947062       0.00000000     )
 (  0.214285731     -0.451753944       0.00000000     )
 (  0.230158746     -0.443877190       0.00000000     )
 (  0.246031761     -0.435279638       0.00000000     )
 (  0.261904836     -0.425917655       0.00000000     )
 (  0.277777851     -0.415739655       0.00000000     )
 (  0.293650866     -0.404684037       0.00000000     )
 (  0.309523880     -0.392676681       0.00000000     )
 (  0.325396895     -0.379627258       0.00000000     )
 (  0.341269910     -0.365424216       0.00000000     )
 (  0.357142925     -0.349927038       0.00000000     )
 (  0.373015940     -0.332955122       0.00000000     )
 (  0.388888955     -0.314269572       0.00000000     )
 (  0.404761970     -0.293543428       0.00000000     )
 (  0.420634985     -0.270307600       0.00000000     )
 (  0.436508000     -0.243845776       0.00000000     )
 (  0.452381015     -0.212958723       0.00000000     )
 (  0.468254030     -0.175323009       0.00000000     )
 (  0.484127045     -0.124984026       0.00000000     )
 (  0.500000000      -0.00000000       0.00000000     )
         );
    interpolate true ;
    }
);

fields          ( p  );


// ************************************************************************* //
